Description: Downloads the latest version of the Microsoft Defender installer package, renames the package and imports it into your JSS.
Identifier: com.github.team-dab.recipes.jamf.microsoftdefender
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.pkg.microsoftdefender

Input:
  NAME: Microsoft Defender
  CATEGORY: Software - Licensed
  GROUP_NAME: "Patch Reporting: %NAME%"
  GROUP_TEMPLATE: SmartGroupUniversalTemplate.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_TEMPLATE: PolicyTemplateJAMF.xml
  POLICY_NAME: "Patch Management - Install Latest %NAME%"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  INITIAL_GROUP_NAME: "%NAME% is not installed"
  INITIAL_GROUP_TEMPLATE: MicrosoftDefenderInitialSmartGroupTemplate.xml
  INITIAL_POLICY_CATEGORY: Software
  INITIAL_POLICY_TEMPLATE: MicrosoftDefenderInitialPolicyTemplate.xml
  INITIAL_POLICY_NAME: "Software - Install %NAME%"
  ADE_POLICY_TEMPLATE: ADEPolicyTemplateJamf.xml
  ADE_POLICY_CATEGORY: "@Automated Device Enrollment"
  ADE_POLICY_NAME: 15 Microsoft Defender
  ADE_POLICY_TRIGGER: DEP_MSDefender
  replace_policy: "True"
  replace_group: "True"



Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%INITIAL_GROUP_TEMPLATE%"
      computergroup_name: "%INITIAL_GROUP_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%INITIAL_POLICY_TEMPLATE%"
      policy_name: "%INITIAL_POLICY_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%ADE_POLICY_TEMPLATE%"
      policy_name: "%ADE_POLICY_NAME%"
    