<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Microsoft Defender installer package, renames the package and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.team-dab.jss.microsoftdefender</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Licensed</string>
		<key>GROUP_NAME</key>
		<string>Patch Reporting: %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>MicrosoftDefenderSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Microsoft Defender</string>
		<key>POLICY_CATEGORY</key>
		<string>Automatic Patch Management</string>
		<key>POLICY_TEMPLATE</key>
		<string>MicrosoftDefenderPolicyTemplate.xml</string>
		<key>INITIAL_GROUP_NAME</key>
		<string>%NAME% is not installed</string>
		<key>INITIAL_GROUP_TEMPLATE</key>
		<string>MicrosoftDefenderInitialGroupTemplate.xml</string>
		<key>INITIAL_POLICY_CATEGORY</key>
		<string>Software</string>
		<key>INITIAL_POLICY_TEMPLATE</key>
		<string>MicrosoftDefenderInitialPolicyTemplate.xml</string>
		<key>INITIAL_POLICY_NAME</key>
		<string>18 Google Chrome</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftdefender</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%INITIAL_POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%INITIAL_POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>STOP_IF_NO_JSS_UPLOAD</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
