<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Microsoft Defender installer package, renames the package and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.team-dab.recipes.jamf.microsoftdefender</string>
	<key>Input</key>
	<dict>
		<key>ADE_POLICY_CATEGORY</key>
		<string>@Automated Device Enrollment</string>
		<key>ADE_POLICY_NAME</key>
		<string>15 Microsoft Defender</string>
		<key>ADE_POLICY_TEMPLATE</key>
		<string>ADEPolicyTemplateJamf.xml</string>
		<key>ADE_POLICY_TRIGGER</key>
		<string>DEP_MSDefender</string>
		<key>CATEGORY</key>
		<string>Software - Licensed</string>
		<key>GROUP_NAME</key>
		<string>Patch Reporting: %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupUniversalTemplate.xml</string>
		<key>INITIAL_GROUP_NAME</key>
		<string>%NAME% is not installed</string>
		<key>INITIAL_GROUP_TEMPLATE</key>
		<string>MicrosoftDefenderInitialSmartGroupTemplate.xml</string>
		<key>INITIAL_POLICY_CATEGORY</key>
		<string>Software - Licensed</string>
		<key>INITIAL_POLICY_NAME</key>
		<string>Software - Install %NAME%</string>
		<key>INITIAL_POLICY_TEMPLATE</key>
		<string>MicrosoftDefenderInitialPolicyTemplate.xml</string>
		<key>NAME</key>
		<string>Microsoft Defender</string>
		<key>POLICY_CATEGORY</key>
		<string>Automatic Patch Management</string>
		<key>POLICY_NAME</key>
		<string>Patch Management - Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplateJAMF.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>replace_group</key>
		<string>True</string>
		<key>replace_policy</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftdefender</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INITIAL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INITIAL_GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%INITIAL_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%INITIAL_POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%ADE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%ADE_POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
