<policy>
	<general>
		<name>%INITIAL_POLICY_NAME%</name>
		<enabled>true</enabled>
		<trigger_checkin>true</trigger_checkin>
		<trigger_enrollment_complete>false</trigger_enrollment_complete>
		<trigger_login>false</trigger_login>
		<trigger_logout>false</trigger_logout>
		<trigger_network_state_changed>false</trigger_network_state_changed>
		<trigger_startup>false</trigger_startup>
		<trigger_other></trigger_other>
		<frequency>Ongoing</frequency>
		<category>
			<name>%INITIAL_POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<all_computers>false</all_computers>
		<computer_groups>
			<computer_group>
				<name>%INITIAL_GROUP_NAME%</name>
			</computer_group>
		</computer_groups>
		<exclusions/>
	</scope>
	<package_configuration>
		<packages>
			<size>1</size>
			<package>
				<name>%pkg_name%</name>
				<action>Install</action>
			</package>
		</packages>
	</package_configuration>
	<scripts>
		<size>0</size>
	</scripts>
	<self_service>
		<use_for_self_service>false</use_for_self_service>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
