Description: Downloads the latest version of the Microsoft Defender installer package, renames the package and imports it into your JSS.
Identifier: com.github.team-dab.recipes.jamf.microsoftdefender
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.pkg.microsoftdefender

Input:
  NAME: Microsoft Defender
  CATEGORY: Software - Licensed
  GROUP_NAME: "Patch Reporting: %NAME%"
  GROUP_TEMPLATE: MicrosoftDefenderSmartGroupTemplate.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_TEMPLATE: MicrosoftDefenderPolicyTemplate.xml
  POLICY_NAME: "Patch Management - Install Latest %NAME%"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"      