Description: Downloads the latest version of Microsoft Teams, makes a pkg of it, and uploads to the JSS.
Identifier: com.github.team-dab.recipes.jamf.MicrosoftTeams
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.pkg.microsoftteams

Input:
  NAME: Microsoft Teams
  CATEGORY: Software - Licensed
  SELFSERVICE_POLICY_CATEGORY: Software - Licensed
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMF.xml
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_DESCRIPTION: Microsoft Teams is the new chat-centered workspace in Office 365. Keep all your content, tools, people, and conversations together in one place.
  SELFSERVICE_ICON: "%NAME%.png"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  replace_group: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      replace_icon: "True"