<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Anaconda and imports into a JAMF Pro Server.</string>
	<key>Identifier</key>
	<string>com.github.team-dab.recipes.jamf.Anaconda</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Unlicensed</string>
		<key>NAME</key>
		<string>Anaconda</string>
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>Install the latest version of %NAME% on your device.</string>
		<key>SELFSERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>SELFSERVICE_POLICY_CATEGORY</key>
		<string>Software - Unlicensed</string>
		<key>SELFSERVICE_POLICY_NAME</key>
		<string>Software - Deploy %NAME% via Self Service</string>
		<key>SELFSERVICE_POLICY_TEMPLATE</key>
		<string>SelfServicePolicyTemplateJAMF.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>replace_policy</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.team-dab.download.Anaconda</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%SELFSERVICE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%SELFSERVICE_POLICY_TEMPLATE%</string>
				<key>replace_icon</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
