Description: Downloads the current release version of Anaconda and imports into a JAMF Pro Server.
Identifier: com.github.team-dab.recipes.jamf.Anaconda
MinimumVersion: "2.3"
ParentRecipe: com.github.team-dab.download.Anaconda

Input:
  NAME: Anaconda
  CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMF.xml
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_DESCRIPTION: Install the latest version of %NAME% on your device.
  SELFSERVICE_ICON: "%NAME%.png"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      