<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest Microsoft AutoUpdate installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.team-dab.jss.MicrosoftAutoUpdate</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft AutoUpdate</string>
            <key>CATEGORY</key>
            <string>Software - Licensed</string>
            <key>POLICY_CATEGORY</key>
            <string>Automatic Patch Management</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>MicrosoftAutoUpdate.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>Patch Reporting: %NAME%</string>
            <key>DESCRIPTION</key>
            <string>Microsoft AutoUpdate keeps Microsoft applications updated with the latest patches from Microsoft.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.MicrosoftAutoUpdate</string>
        <key>Process</key>
        <array>
        <dict>
		    <key>Processor</key>
		    <string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	    </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
