Description: Downloads the latest version of Microsoft Edge, makes a pkg of it, and uploads to the JSS.
Identifier: com.github.team-dab.recipes.jamf.MicrosoftEdge
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.pkg.microsoftedge

Input:
  NAME: Microsoft Edge
  CATEGORY: Software - Unlicensed
  GROUP_NAME: "Patch Reporting: %NAME%"
  GROUP_TEMPLATE: SmartGroupUniversalTemplateAlerter.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_TEMPLATE: PolicyTemplateJAMFTrigger.xml
  POLICY_NAME: "Patch Management - Install Latest %NAME%"
  POLICY_TRIGGER: Install_EdgeUpdate
  SELFSERVICE_POLICY_CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMF.xml
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_DESCRIPTION: Microsoft Edge is a cross-platform web browser created and developed by Microsoft.
  SELFSERVICE_ICON: "%NAME%.png"
  ADE_POLICY_TEMPLATE: ADEPolicyTemplateJamf.xml
  ADE_POLICY_CATEGORY: "@Automated Device Enrollment"
  ADE_POLICY_NAME: 21 Microsoft Edge
  ADE_POLICY_TRIGGER: DEP_MSEdge
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  replace_group: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%ADE_POLICY_TEMPLATE%"
      policy_name: "%ADE_POLICY_NAME%"