<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of Intellij IDEA and imports into a JAMF Pro Server.</string>
  <key>Identifier</key>
  <string>com.github.team-dab.jss.IntelliJIDEA-ARM64</string>
  <key>Input</key>
  <dict>
    <key>platform</key>
    <string>macM1</string>
    <key>CATEGORY</key>
    <string>Software - Licensed</string>
    <key>NAME</key>
    <string>IntelliJ Idea Ultimate-ARM64</string>
    <key>APPNAME_WITHOUTPROCESSOR</key>
    <string>IntelliJ Idea Ultimate</string>
    <key>SELF_SERVICE_DESCRIPTION</key>
    <string>Install the latest version of IntelliJ Idea Ultimate on your device.</string>
    <key>SELFSERVICE_GROUP_TEMPLATE</key>
    <string>SelfServiceSmartGroupTemplate.xml</string>
    <key>SELFSERVICE_POLICY_TEMPLATE</key>
    <string>SelfServicePolicyARM64Template.xml</string>
    <key>SELF_SERVICE_ICON</key>
    <string>IDEA-IU.png</string>
    <key>SELFSERVICE_POLICY_CATEGORY</key>
    <string>Software - Licensed</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.0</string>
  <key>ParentRecipe</key>
  <string>com.github.team-dab.pkg.IntelliJIDEA</string>
  <key>Process</key>
  <array>
  <dict>
		<key>Processor</key>
		<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	</dict>
    <dict>
      <key>Arguments</key>
      <dict>				
        <key>category</key>
        <string>%CATEGORY%</string>
        <key>groups</key>
        <array>
          <dict>
            <key>name</key>
            <string></string>
          </dict>
        </array>
        <key>policy_category</key>
        <string>%SELFSERVICE_POLICY_CATEGORY%</string>
        <key>policy_template</key>
        <string>%SELFSERVICE_POLICY_TEMPLATE%</string>
        <key>prod_name</key>
        <string>%NAME%</string>
        <key>self_service_description</key>
        <string>%SELF_SERVICE_DESCRIPTION%</string>
        <key>self_service_icon</key>
        <string>%SELF_SERVICE_ICON%</string>
        <key>STOP_IF_NO_JSS_UPLOAD</key>
        <string>False</string>
      </dict>
      <key>Comment</key>
      <string>Self Service install policy</string>
      <key>Processor</key>
      <string>JSSImporter</string>
    </dict>  
  </array>
</dict>
</plist>