<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Spotify dmg and creates a pkg from it. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.team-dab.jss.Spotify</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Unlicensed</string>
		<key>GROUP_NAME</key>
		<string>Patch Reporting: %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupARM64Template.xml</string>
		<key>NAME</key>
		<string>Spotify-ARM64</string>
		<key>POLICY_CATEGORY</key>
		<string>Automatic Patch Management</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>APPNAME_WITHOUTPROCESSOR</key>
		<string>Spotify</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Stream music, create playlists and more.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%APPNAME_WITHOUTPROCESSOR%.png</string>
		<key>SELFSERVICE_GROUP_TEMPLATE</key>
		<string>SelfServiceSmartGroupTemplate.xml</string>
		<key>SELFSERVICE_POLICY_TEMPLATE</key>
		<string>SelfServicePolicyARM64Template.xml</string>
		<key>SELFSERVICE_POLICY_CATEGORY</key>
		<string>Software - Unlicensed</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.Spotify</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>version</key>
			<string>%version%</string>
		</dict>
		<key>Processor</key>
		<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>SpotifyPostinstall.sh</string>
						<key>template_path</key>
						<string>SpotifyScriptTemplate.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string></string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%SELFSERVICE_POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%SELFSERVICE_POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>STOP_IF_NO_JSS_UPLOAD</key>
				<string>False</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
