Description: Downloads the latest version of Spotify, makes a pkg of it, and uploads to the JSS.
Identifier: com.github.team-dab.recipes.jamf.Spotify-ARM64
MinimumVersion: "2.3"
ParentRecipe: com.github.homebysix.pkg.Spotify

Input:
  NAME: Spotify-ARM64
  CATEGORY: Software - Unlicensed
  GROUP_NAME: "Patch Reporting: %NAME%"
  GROUP_TEMPLATE: SmartGroupARM64Template.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_TEMPLATE: PolicyTemplateJAMFScript.xml
  POLICY_NAME: "Patch Management - Install Latest %NAME%"
  SELFSERVICE_POLICY_CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMFARM64Script.xml
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_DESCRIPTION: Stream music, create playlists and more.
  SELFSERVICE_ICON: "%APPNAME_WITHOUTPROCESSOR%.png"
  APPNAME_WITHOUTPROCESSOR: Spotify
  DOWNLOAD_URL: "https://download.scdn.co/SpotifyARM64.dmg"
  SCRIPT_NAME: "SpotifyPostinstall.sh"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  replace_group: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%SELFSERVICE_ICON%"