Description: Downloads the latest version of Wireshark, makes a pkg of it, and uploads to the JSS.
Identifier: com.github.team-dab.recipes.jamf.Wireshark-ARM64
ParentRecipe: com.github.homebysix.pkg.Wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark-ARM64
  APPNAME_WITHOUTPROCESSOR: Wireshark
  ARCH: Arm
  CATEGORY: Software - Unlicensed
  GROUP_NAME: 'Patch Reporting: %NAME%'
  GROUP_TEMPLATE: SmartGroupARM64Template.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_NAME: Patch Management - Install Latest %NAME%
  POLICY_TEMPLATE: PolicyTemplateJAMF.xml
  SELFSERVICE_DESCRIPTION: Wireshark is a free and open source packet analyzer. It is used for network troubleshooting, analysis, software and communications protocol development, and education.
  SELFSERVICE_ICON: '%APPNAME_WITHOUTPROCESSOR%.png'
  SELFSERVICE_POLICY_CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMFARM64.xml
  UPDATE_PREDICATE: pkg_uploaded == False
  replace_group: 'True'
  replace_policy: 'True'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELFSERVICE_ICON%'
    policy_name: '%SELFSERVICE_POLICY_NAME%'
    policy_template: '%SELFSERVICE_POLICY_TEMPLATE%'
