<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest unlicensed iTerm2 installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.team-dab.jss.iTerm2</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>iTerm2</string>
            <key>CATEGORY</key>
            <string>Software - Unlicensed</string>
            <key>POLICY_CATEGORY</key>
            <string>Software - Unlicensed</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/SelfServicePolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/iTerm2.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SelfServiceSmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>iTerm2 is a replacement for Terminal.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>io.github.hjuutilainen.pkg.iTerm2</string>
        <key>Process</key>
        <array>
        <dict>
		    <key>Processor</key>
		    <string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	    </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
