Description: Downloads the current release version of Cyberduck and builds a package. Then, uploads to the JSS.
Identifier: com.github.team-dab.recipes.jamf.Cyberduck
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.Cyberduck

Input:
  NAME: Cyberduck
  CATEGORY: Software - Unlicensed
  GROUP_NAME: "Patch Reporting: %NAME%"
  GROUP_TEMPLATE: SmartGroupUniversalTemplate.xml
  POLICY_CATEGORY: Automatic Patch Management
  POLICY_TEMPLATE: PolicyTemplateJAMF.xml
  POLICY_NAME: "Patch Management - Install Latest %NAME%"
  SELFSERVICE_POLICY_CATEGORY: Software - Unlicensed
  SELFSERVICE_POLICY_TEMPLATE: SelfServicePolicyTemplateJAMF.xml
  SELFSERVICE_POLICY_NAME: Software - Deploy %NAME% via Self Service
  SELFSERVICE_DESCRIPTION: With an easy to use interface, connect to FTP, SFTP, WebDAV, Amazon S3, Google Storage, Windows Azure, Rackspace Cloud Files and even Google Docs.
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  replace_group: "True"
  

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
      
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator
  
  - Processor: com.github.haircut.processors/AppIconExtractor
    Arguments:
      source_app: "%RECIPE_CACHE_DIR%/%NAME%/Applications/Cyberduck.app"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SELFSERVICE_POLICY_TEMPLATE%"
      policy_name: "%SELFSERVICE_POLICY_NAME%"
      icon: "%APP_ICON_PATH%"
      replace_icon: "True"
      